cs312/hw7/hw7.tex
% Created 2024-10-20 Sun 18:16
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\author{Jackson Mowry}
\date{\today}
\title{Hw7}
\hypersetup{
 pdfauthor={Jackson Mowry},
 pdftitle={Hw7},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 29.4 (Org mode 9.7.11)}, 
 pdflang={English}}
\begin{document}

\maketitle
\section{1}
\label{sec:org4a50f81}
A = \{0\textsuperscript{n}\#0\textsuperscript{2n}\#0\textsuperscript{3n} | n \(\ge\) 0\}. Hint: consider s = 0\textsuperscript{p}\#0\textsuperscript{2p}\#0\textsuperscript{3p}.\\

Assume that A is a context free language and let p be the pumping length for the language. Choose the string s = 0\textsuperscript{p}\#0\textsuperscript{2p}\#0\textsuperscript{3p} \(\in\) A so that clearly |s| > p. By condition 1 of the PL for CFLs, we can partition s = uvxyz such that for all i \(\ge\) 0, uv\textsuperscript{i}xy\textsuperscript{i}z \(\in\) A. In order to show that s cannot be pumped, let's consider the ramifications of Condition 1 of the PL for CFLs for the contents of v and y.\\

If either v or y contain the '\#' symbol. S' = uv\textsuperscript{2}xy\textsuperscript{2}z \(\notin\) A as the resulting string would now contain greater than 2 '\#' symbols, therefore s' condition 1 of the PL for CFLs is violated.\\

By condition 3 of the PL for CFLs we know that |vxy| \(\le\) p, therefore we can choose vxy to consist of entirely 0's in the second segment (0\textsuperscript{2p}). This means that both v and y also consist entirely of 0's. If we then pump up uv\textsuperscript{2}xy\textsuperscript{2}z, the resulting string s' \(\notin\) A, as the second segment would now contain more than 2n 0's, while the other sections (including '\#' symbols would remain the same), violating the constraint originally laid out (0\textsuperscript{n}\#0\textsuperscript{2n}\#0\textsuperscript{3n}). We can also consider the case where either v or y contains the '\#' symbol, keeping the same s' = uv\textsuperscript{2}xy\textsuperscript{2}z we now violate the strict ordering of 0's and \#'s by introducing additional \# symbols between 0's. Therefore s' \(\notin\) A and condition 1 of the PL for CFLs is violated, and we can conclude that A is not a CFL.\#\\
\section{2}
\label{sec:orgb895d5e}
C = \{w | the number of 1s equals the number of 2s and the number of 3s equals the number of 4s\} and \(\Sigma\) = \{1,2,3,4\}. Hint: consider s = 1\textsuperscript{p}3\textsuperscript{p}2\textsuperscript{p}4\textsuperscript{p}.\\

Assume that C is a context free language and let p be the pumping length for the language. Choose the string s = 1\textsuperscript{p}3\textsuperscript{p}2\textsuperscript{p}4\textsuperscript{p} \(\in\) C so that clearly |s| > p. By condition 1 of the PL for CFLs, we can partition s = uvxyz such that for all i \(\ge\) 0, uv\textsuperscript{i}xy\textsuperscript{i}z \(\in\) A. In order to show that s cannot be pumped, let's consider the ramifications of Condition 1 of the PL for CFLs for the contents of v and y.\\

When both v and y contain only one type of symbol (terminal), then s' = uv\textsuperscript{2}xy\textsuperscript{2}z cannot contain equal numbers of 1's and 2's, or 3's and 4's, because one symbol would be present more times than the other in its pairing. Therefore s' \(\notin\) C and condition 1 of the PL for CFLs is violated, and we can conclude that C is not a CFL.\#\\
\section{3}
\label{sec:org160a401}
B = \{w\#t | w is a substring of t, where w, t \(\in\) \{a, b\}∗\}. Hint: consider s = a\textsuperscript{p}b\textsuperscript{p}\#a\textsuperscript{p}b\textsuperscript{p}.\\

Assume that B is a context free language and let p be the pumping length for the languge. Choose the string s = a\textsuperscript{p}b\textsuperscript{p}\#a\textsuperscript{p}b\textsuperscript{p} \(\in\) B so that clearly |s| > p. By condition 1 of the PL for CFLs, we can partition s = uvxyz such that for all i \(\ge\) 0, uv\textsuperscript{i}xy\textsuperscript{i}z \(\in\) B. In order to show that s cannot be pumped, let's consider the ramifications for Condition 1 of the PL for CFLs for the contents of v and y.\\

When v and y contain ony one type of symbol (not '\#'), and v/y occupy the begining of the string (substring w), then s' = uv\textsuperscript{2}xy\textsuperscript{2}z \(\notin\) B because the w would no longer be a substring of t as it contains either more a's or b's and t. Therefore s' \(\notin\) B and condition 1 of the PL for CFLs is violated.\\

When either v or y contain the '\#' symbol (terminal). S' = uv\textsuperscript{2}xy\textsuperscript{2}z \(\notin\) B due to the fact that the '\#' symbol is now repeated more than once. Hence s' \(\notin\) B, because condition 1 of the PL for CFLs is violated.\\

Since one of the above case must apply for any s \(\in\) B, we can conclude that B is not a CFL.\#\\
\end{document}
